app/controllers/blogs_controller.rb

SELECT  "blogs".* FROM "blogs" LIMIT ?  [["LIMIT", 1]]
---
  def index
    @blogs = Blog.all

INSERT INTO "blogs" ("title", "body", "created_at", "updated_at", "slug") VALUES (?, ?, ?, ?, ?)  [["title", "you"], ["body", "suck"], ["created_at", "2019-08-06 04:34:51.367350"], ["updated_at", "2019-08-06 04:34:51.367350"], ["slug", "you"]]
---
  def create
    @blog = Blog.new(blog_params)

    respond_to do |format|
      if @blog.save