app/controllers/portfolios_controller.rb

  def create
    @portfolio_item = Portfolio.new(params.require(:portfolio).permit(:title, :subtitle, :body, technologies_attributes: [:name]))

    respond_to do |format|
      if @portfolio_item.save
---
INSERT INTO "portfolios" ("title", "subtitle", "body", "main_image", "thumb_image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
INSERT INTO "technologies" ("name", "portfolio_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "rails"], ["portfolio_id", 24], ["created_at", "2019-08-11 23:45:53.094432"], ["updated_at", "2019-08-11 23:45:53.094432"]]

  def update
    @portfolio_item = Portfolio.find(params[:id])
---
SELECT  "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]